#include <iostream>
#include <windows.h>

/*
 * Практична робота №1
 * Тема: Компілятор, інтерпретатор, компонувальник. Структура і способи опису мов програмування високого рівня.
 * Завдання: Виведення добутку двох чисел
 */
int main() 
{
    //setlocale(LC_ALL, "Russian"); -Чомусь навіть з цим рядком кирилиця не відображається правильно, тому використовую windows.h
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);

    // Створення змiнних для чисел користувача
    int a = 0;
    int b = 0;

    // Задання чисел користувачем
    std::cout << "Перше число: ";
    std::cin >> a;
    std::cout << "Друге число: ";
    std::cin >> b;

    // Виведення добутку двох чисел
    std::cout << a << "*" << b << " = " << a*b;
}